// Модуль документа Заморозка абонемента

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	АбКлиента = Абонемент.ПолучитьОбъект();
	ВидАбонемента = АбКлиента.ВидАбонемента;

	// Ограничения
	Если АбКлиента.Статус = Перечисления.СтатусыАбонементаКлиента.Истёк Тогда
		ВызватьИсключение "Невозможно заморозить истёкший абонемент.";
	КонецЕсли;

	КоличествоДней = (ДатаОкончания - ДатаНачала) / 86400;
	Если Не ВидАбонемента.ВозможностьЗаморозки Тогда
		ВызватьИсключение "Данный абонемент не допускает заморозку.";
	КонецЕсли;
	Если КоличествоДней > ВидАбонемента.МаксимальныйСрокЗаморозки Тогда
		ВызватьИсключение "Превышен допустимый срок заморозки.";
	КонецЕсли;

	АбКлиента.Статус = Перечисления.СтатусыАбонементаКлиента.Заморожен;
	АбКлиента.Заморожено = АбКлиента.Заморожено + КоличествоДней;
	АбКлиента.ДатаОкончания = АбКлиента.ДатаОкончания + КоличествоДней;
	АбКлиента.Записать();

	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Заморозка абонемента", "", Строка(Абонемент));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(Абонемент) Тогда
		Сообщить("Не указан абонемент");
		Отказ = Истина;
	КонецЕсли;
	Если ДатаОкончания <= ДатаНачала Тогда
		Сообщить("Дата окончания должна быть позже даты начала");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
