// Проверка прав доступа пользователей

Функция ЕстьАдминистратор() Экспорт
	Роль = ПараметрыСеанса.ТекущаяРоль;
	Возврат Роль = "Администратор" ИЛИ Роль = "Руководитель";
КонецФункции

Функция МожноРедактироватьФинансы() Экспорт
	Роль = ПараметрыСеанса.ТекущаяРоль;
	Возврат Роль = "Администратор" ИЛИ Роль = "Бухгалтер";
КонецФункции

Функция МожноОтмечатьПосещения() Экспорт
	Роль = ПараметрыСеанса.ТекущаяРоль;
	Возврат Роль = "Администратор" ИЛИ Роль = "Преподаватель";
КонецФункции

Функция ТолькоПросмотр() Экспорт
	Возврат ПараметрыСеанса.ТекущаяРоль = "Наблюдатель";
КонецФункции
